// ----------------------------------------------------------------------------------------------------------
// ---- popov 26.02.2021 ----
// ----------------------------------------------------------------------------------------------------------
// все объекты, прочитанные из БД "Искусство и Искусствоведы", имеют свойство "Идентификатор"
// ----------------------------------------------------------------------------------------------------------
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Art_DataBase_Analytical_MVVM.Model.Data
{
    public interface IArtObject
    {
        // идентификатор объекта из БД "Искусство и Искусствоведы"
        int ID { get; }
    }
}
