// ----------------------------------------------------------------------------------------------------
// ---- popov 14.02.2021 ----
// ----------------------------------------------------------------------------------------------------
// Интерфейс Контроллер - через него главное окно программы взаимодействует с Контроллером.
// ----------------------------------------------------------------------------------------------------

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

using Put_Image_In_DataBase_EF.View;

using Put_Image_In_DataBase_EF.EventArguments;

namespace Put_Image_In_DataBase_EF.Controller
{
    public interface IController
    {   
        // ----------------------------------------------------------------------------------------
        // ---- Обработчики событий, возникающих в Представлении ----
        // ----------------------------------------------------------------------------------------
        // Временное сохранение картины в памяти (и ее отображение в главном окне)
        void CreateCanvas(object o, FileNameEventArgs e);

        // Передача текущей картины в БД "Искусство и Искусствоведы"
        void PutCanvasInDB(object o, CanvasNameEventArgs e);

        // ---------------------------------------------------------------------------------------
        // ---- События, возникающие а Контроллере и обрабатываемые в Представлении ----
        // ---------------------------------------------------------------------------------------
        // очистить все визуальные компоненты
        event EventHandler ClearAllComponents;

        // отобразить данные о изображении из объекта
        event EventHandler<CanvasInfoEventArgs> ShowNewCanvas;

        // отчет о том, удалось сохранить Картину в БД "Искусство и Искусствоведы", или нет.
        event EventHandler<CanvasResultEventArgs> CanvasReport;        
    }
}
