// ---------------------------------------------------------------------------------------------------------
// ---- popov  17.02.2021 ----
// ---------------------------------------------------------------------------------------------------------
// Все запрошенные данные из одной строки в БД
// По результатам успешного выполнения запроса SELECT возвращается сразу много таких объектов.
// ---------------------------------------------------------------------------------------------------------

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace DataBase_Operations
{
    public interface IReturnedObject
    {
        object[] Fields { get; }
    }
}
